In [1]:
import pandas as pd

In [3]:
CCTV_Seoul = pd.read_csv('CCTV.csv', encoding = 'utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [5]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [6]:
CCTV_Seoul.columns[0]

'기관명'

In [12]:
CCTV_Seoul.rename(columns= {CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [10]:
pop_Seoul= pd.read_excel('Population.xls', incoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.3/4,합계,4219001,10158411,4975437,5182974,9891448,4849195,5042253,266963,126242,140721,2.34,1353486
3,2017.3/4,종로구,73668,164640,80173,84467,155109,76155,78954,9531,4018,5513,2.11,26034
4,2017.3/4,중구,60130,134174,66064,68110,125332,62011,63321,8842,4053,4789,2.08,21249

In [14]:
pop_Seoul= pd.read_excel('Population.xls',
                         header=2, usecols= 'B,D,G,J,N',
                         incoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10158411.0  9891448.0  266963.0  1353486.0
1  종로구    164640.0   155109.0    9531.0    26034.0
2   중구    134174.0   125332.0    8842.0    21249.0
3  용산구    243922.0   228960.0   14962.0    36727.0
4  성동구    312933.0   304879.0    8054.0    40902.0

In [15]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]:'구별',
                          pop_Seoul.columns[1]:'인구수',
                          pop_Seoul.columns[2]:'한국인',
                          pop_Seoul.columns[3]:'외국인',
                          pop_Seoul.columns[4]:'고령자',}, inplace=True)        
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10158411.0  9891448.0  266963.0  1353486.0
1  종로구    164640.0   155109.0    9531.0    26034.0
2   중구    134174.0   125332.0    8842.0    21249.0
3  용산구    243922.0   228960.0   14962.0    36727.0
4  성동구    312933.0   304879.0    8054.0    40902.0

In [16]:
import pandas as pd
import numpy as np

In [20]:
s= pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [23]:
dates= pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df= pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479
2013-01-02  0.553284  1.353931 -1.167891 -0.760533
2013-01-03 -0.788051 -0.324693  1.372282  0.358737
2013-01-04 -0.773048  1.757029  1.564725 -0.974778
2013-01-05  0.483844 -0.631315 -0.555305  0.486400
2013-01-06 -0.450233  1.190397  0.219267 -1.214724

In [32]:
df.tail(1)

                   A         B         C         D
2013-01-06 -0.450233  1.190397  0.219267 -1.214724

In [34]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [35]:
sdf.value

NameError: name 'sdf' is not defined

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [41]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.514416  0.215842 -0.036117 -0.298070
std    0.983422  1.467345  1.324076  0.766357
min   -2.112290 -2.050300 -1.649783 -1.214724
25%   -0.784300 -0.554659 -1.014744 -0.921217
50%   -0.611640  0.432852 -0.168019 -0.222027
75%    0.250324  1.313048  1.084028  0.348172
max    0.553284  1.757029  1.564725  0.486400

In [42]:
df

                   A         B         C         D
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479
2013-01-02  0.553284  1.353931 -1.167891 -0.760533
2013-01-03 -0.788051 -0.324693  1.372282  0.358737
2013-01-04 -0.773048  1.757029  1.564725 -0.974778
2013-01-05  0.483844 -0.631315 -0.555305  0.486400
2013-01-06 -0.450233  1.190397  0.219267 -1.214724

In [43]:
df'A'

SyntaxError: invalid syntax (<ipython-input-43-3e958e6a376d>, line 1)

In [44]:
df 'A'

SyntaxError: invalid syntax (<ipython-input-44-fe477b87ed0b>, line 1)

In [45]:
df('A')

TypeError: 'DataFrame' object is not callable

In [46]:
df['A']

2013-01-01   -2.112290
2013-01-02    0.553284
2013-01-03   -0.788051
2013-01-04   -0.773048
2013-01-05    0.483844
2013-01-06   -0.450233
Freq: D, Name: A, dtype: float64

In [47]:
df[0:3]

                   A         B         C         D
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479
2013-01-02  0.553284  1.353931 -1.167891 -0.760533
2013-01-03 -0.788051 -0.324693  1.372282  0.358737

In [51]:
print(df.loc[dates[0]])

A   -2.112290
B   -2.050300
C   -1.649783
D    0.316479
Name: 2013-01-01 00:00:00, dtype: float64

In [53]:
df.loc[:,['A', 'B']]

                   A         B
2013-01-01 -2.112290 -2.050300
2013-01-02  0.553284  1.353931
2013-01-03 -0.788051 -0.324693
2013-01-04 -0.773048  1.757029
2013-01-05  0.483844 -0.631315
2013-01-06 -0.450233  1.190397

In [54]:
df.iloc[3]

A   -0.773048
B    1.757029
C    1.564725
D   -0.974778
Name: 2013-01-04 00:00:00, dtype: float64

In [56]:
df [df.A>0]

                   A         B         C         D
2013-01-02  0.553284  1.353931 -1.167891 -0.760533
2013-01-05  0.483844 -0.631315 -0.555305  0.486400

In [57]:
df2 = df

In [58]:
df2['E'] = ['Tus', 'Wen','Thu','Fri','Sat','Sun']
df2

                   A         B         C         D    E
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479  Tus
2013-01-02  0.553284  1.353931 -1.167891 -0.760533  Wen
2013-01-03 -0.788051 -0.324693  1.372282  0.358737  Thu
2013-01-04 -0.773048  1.757029  1.564725 -0.974778  Fri
2013-01-05  0.483844 -0.631315 -0.555305  0.486400  Sat
2013-01-06 -0.450233  1.190397  0.219267 -1.214724  Sun

In [59]:
df

                   A         B         C         D    E
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479  Tus
2013-01-02  0.553284  1.353931 -1.167891 -0.760533  Wen
2013-01-03 -0.788051 -0.324693  1.372282  0.358737  Thu
2013-01-04 -0.773048  1.757029  1.564725 -0.974778  Fri
2013-01-05  0.483844 -0.631315 -0.555305  0.486400  Sat
2013-01-06 -0.450233  1.190397  0.219267 -1.214724  Sun

In [60]:
df3 = df.copy()

In [61]:
df3['F'] =['a','b','c','d','e','f']

In [62]:
df3

                   A         B         C         D    E  F
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479  Tus  a
2013-01-02  0.553284  1.353931 -1.167891 -0.760533  Wen  b
2013-01-03 -0.788051 -0.324693  1.372282  0.358737  Thu  c
2013-01-04 -0.773048  1.757029  1.564725 -0.974778  Fri  d
2013-01-05  0.483844 -0.631315 -0.555305  0.486400  Sat  e
2013-01-06 -0.450233  1.190397  0.219267 -1.214724  Sun  f

In [63]:
df

                   A         B         C         D    E
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479  Tus
2013-01-02  0.553284  1.353931 -1.167891 -0.760533  Wen
2013-01-03 -0.788051 -0.324693  1.372282  0.358737  Thu
2013-01-04 -0.773048  1.757029  1.564725 -0.974778  Fri
2013-01-05  0.483844 -0.631315 -0.555305  0.486400  Sat
2013-01-06 -0.450233  1.190397  0.219267 -1.214724  Sun

In [65]:
df.apply(np.cumsum)

                   A         B         C         D                   E
2013-01-01 -2.112290 -2.050300 -1.649783  0.316479                 Tus
2013-01-02 -1.559006 -0.696368 -2.817674 -0.444053              TusWen
2013-01-03 -2.347057 -1.021061 -1.445391 -0.085317           TusWenThu
2013-01-04 -3.120104  0.735967  0.119334 -1.060094        TusWenThuFri
2013-01-05 -2.636261  0.104652 -0.435971 -0.573695     TusWenThuFriSat
2013-01-06 -3.086494  1.295049 -0.216705 -1.788418  TusWenThuFriSatSun

In [66]:
df.apply(lambda x:x.max()- x.min())

TypeError: ("unsupported operand type(s) for -: 'str' and 'str'", 'occurred at index E')